{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Homemade Chicken Nuggets with Ground Chicken",
    "1": "Bhindi Recipe (Pakistani)",
    "2": "Kaleji Fry Masala Recipe | Liver Fry",
    "3": "Achari Chicken",
    "4": "Kaari Chawal Recipe",
    "5": "Sheer Khurma",
    "6": "Spicy Chicken Lettuce Wraps",
    "7": "Guava Jam",
    "8": "Paneer Reshmi Chicken Handi",
    "9": "White Chicken Korma",
    "10": "Chicken Pakora",
    "11": "Imli Aloo Bukharay Ka Sharbat",
    "12": "Lemon Mousse Cake",
    "13": "Mango Kulfi Recipe",
    "14": "Green Chutney",
    "15": "Mix Sabzi",
    "16": "Black Cherry Ice Cream Recipe",
    "17": "Kashmiri Chicken",
    "18": "Potato Cheese Balls Recipe",
    "19": "Oreo Cookie Ice Cream",
    "20": "Chicken Karahi Recipe",
    "21": "Spicy Chicken Sandwich",
    "22": "Homemade Lemon Ice Cream",
    "23": "Aloo Gosht",
    "24": "Peach Juice",
    "25": "Peach Ice Cream Recipe (No-Eggs)",
    "26": "Shami Kabab Recipe",
    "27": "Homemade Strawberry Ice Cream with Condensed Milk",
    "28": "Salted Caramel Sauce Recipe",
    "29": "Bohra Kharak Recipe (Kharik)",
    "30": "Beef Seekh Kebab (Pakistani)",
    "31": "Indian Butter Chicken",
    "32": "Oreo Balls with Condensed Milk",
    "33": "Karahi Gosht",
    "34": "Aloo Chana Chaat",
    "35": "Rocky Road Ice Cream Recipe",
    "36": "Chicken Burger Patty",
    "37": "Hariyali Chicken Tikka",
    "38": "Chapli Kabab Recipe",
    "39": "Bohra Kalamra Recipe",
    "40": "Dulce De Leche (Boiled Condensed Milk)",
    "41": "Chicken Boti",
    "42": "Mango Jam",
    "43": "Gajar Ka Halwa",
    "44": "Date Balls Recipe",
    "45": "Dynamite Chicken",
    "46": "Plum Ice Cream",
    "47": "Spicy Mongolian Beef",
    "48": "Chicken Bread Recipe",
    "49": "Soft Roti Recipe (with Secret Tips)",
    "50": "Plum Jam Recipe Without Pectin",
    "51": "Pakistani Aloo Palak Recipe",
    "52": "Walnut Brownie Recipe",
    "53": "Dum Ka Keema",
    "54": "Ketchup Chicken Recipe (Tikka Flavor)",
    "55": "Chicken Samosa",
    "56": "Bajra Roti",
    "57": "Grape Jam",
    "58": "Plum Juice Recipe",
    "59": "Date Roll",
    "60": "Chicken Handi",
    "61": "Mutton Soup Recipe (Bohra Khurdi)",
    "62": "Dulce De Leche Mousse",
    "63": "Keema cutlets (Beef or Mutton)",
    "64": "Easy Hoisin Sauce Recipe",
    "65": "Bohra Kaari Masala",
    "66": "Mutton Leg Roast (Raan)",
    "67": "Karak Chai",
    "68": "White Chicken Karahi",
    "69": "Chocolate Cold Cake Recipe",
    "70": "Chicken Egg Roll",
    "71": "Coconut Balls Recipe (with Condensed Milk)",
    "72": "Papaya Jam",
    "73": "Pakistani Chicken Biryani",
    "74": "Tikka Paratha Roll Bake",
    "75": "Yakhni Pulao",
    "76": "Dried Dates Pudding Recipe",
    "77": "Mutton Paya",
    "78": "Chicken Nihari Recipe",
    "79": "Thai Chicken Satay",
    "80": "Mango Delight Recipe",
    "81": "Chicken Haleem Recipe",
    "82": "Sarson Ka Saag Pakistani",
    "83": "Banana Jam",
    "84": "Chicken Tikka Recipe Pakistani",
    "85": "Khagina Recipe (Pakistani breakfast)",
    "86": "Gol Papdi",
    "87": "Keema Samosa Recipe",
    "88": "Chicken Pasta (with White Sauce)",
    "89": "Tomato Jam Recipe",
    "90": "Nihari Recipe",
    "91": "Keema Naan Recipe",
    "92": "Easy Tom Kha Gai",
    "93": "Egg Halwa",
    "94": "Chicken Seekh Kabab Recipe",
    "95": "Thai Red Curry Chicken\u00a0",
    "96": "Cherry Jam (without Pectin)",
    "97": "Indian Shepherd's Pie Recipe",
    "98": "Cinnamon Spice Tea Recipe",
    "99": "Brownie Recipe With Oil",
    "100": "Nihari Masala",
    "101": "Apple Jam",
    "102": "Bohra Fried Chicken",
    "103": "Kiwi Jam",
    "104": "Eggplant Fries Recipe",
    "105": "Coffee Ice Cream Recipe",
    "106": "Chicken Korma Recipe (Pakistani)",
    "107": "Vegetable Samosa",
    "108": "Keema Khichri",
    "109": "Homemade Tomato Ketchup From Fresh Tomatoes",
    "110": "Strawberry Jam without Pectin",
    "111": "Chicken Crepes",
    "112": "Kofta Curry",
    "113": "Pear Jam",
    "114": "Haleem Recipe",
    "115": "Peach Jam Recipe without Pectin",
    "116": "Aloo Tikki Recipe",
    "117": "Vegetable Biryani",
    "118": "Carrot Bundt Cake",
    "119": "Hummus Recipe without Tahini"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Achari Chicken": 3,
    "Aloo Chana Chaat": 34,
    "Aloo Gosht": 23,
    "Aloo Tikki Recipe": 116,
    "Apple Jam": 101,
    "Bajra Roti": 56,
    "Banana Jam": 83,
    "Beef Seekh Kebab (Pakistani)": 30,
    "Bhindi Recipe (Pakistani)": 1,
    "Black Cherry Ice Cream Recipe": 16,
    "Bohra Fried Chicken": 102,
    "Bohra Kaari Masala": 65,
    "Bohra Kalamra Recipe": 39,
    "Bohra Kharak Recipe (Kharik)": 29,
    "Brownie Recipe With Oil": 99,
    "Carrot Bundt Cake": 118,
    "Chapli Kabab Recipe": 38,
    "Cherry Jam (without Pectin)": 96,
    "Chicken Boti": 41,
    "Chicken Bread Recipe": 48,
    "Chicken Burger Patty": 36,
    "Chicken Crepes": 111,
    "Chicken Egg Roll": 70,
    "Chicken Haleem Recipe": 81,
    "Chicken Handi": 60,
    "Chicken Karahi Recipe": 20,
    "Chicken Korma Recipe (Pakistani)": 106,
    "Chicken Nihari Recipe": 78,
    "Chicken Pakora": 10,
    "Chicken Pasta (with White Sauce)": 88,
    "Chicken Samosa": 55,
    "Chicken Seekh Kabab Recipe": 94,
    "Chicken Tikka Recipe Pakistani": 84,
    "Chocolate Cold Cake Recipe": 69,
    "Cinnamon Spice Tea Recipe": 98,
    "Coconut Balls Recipe (with Condensed Milk)": 71,
    "Coffee Ice Cream Recipe": 105,
    "Date Balls Recipe": 44,
    "Date Roll": 59,
    "Dried Dates Pudding Recipe": 76,
    "Dulce De Leche (Boiled Condensed Milk)": 40,
    "Dulce De Leche Mousse": 62,
    "Dum Ka Keema": 53,
    "Dynamite Chicken": 45,
    "Easy Hoisin Sauce Recipe": 64,
    "Easy Tom Kha Gai": 92,
    "Egg Halwa": 93,
    "Eggplant Fries Recipe": 104,
    "Gajar Ka Halwa": 43,
    "Gol Papdi": 86,
    "Grape Jam": 57,
    "Green Chutney": 14,
    "Guava Jam": 7,
    "Haleem Recipe": 114,
    "Hariyali Chicken Tikka": 37,
    "Homemade Chicken Nuggets with Ground Chicken": 0,
    "Homemade Lemon Ice Cream": 22,
    "Homemade Strawberry Ice Cream with Condensed Milk": 27,
    "Homemade Tomato Ketchup From Fresh Tomatoes": 109,
    "Hummus Recipe without Tahini": 119,
    "Imli Aloo Bukharay Ka Sharbat": 11,
    "Indian Butter Chicken": 31,
    "Indian Shepherd's Pie Recipe": 97,
    "Kaari Chawal Recipe": 4,
    "Kaleji Fry Masala Recipe | Liver Fry": 2,
    "Karahi Gosht": 33,
    "Karak Chai": 67,
    "Kashmiri Chicken": 17,
    "Keema Khichri": 108,
    "Keema Naan Recipe": 91,
    "Keema Samosa Recipe": 87,
    "Keema cutlets (Beef or Mutton)": 63,
    "Ketchup Chicken Recipe (Tikka Flavor)": 54,
    "Khagina Recipe (Pakistani breakfast)": 85,
    "Kiwi Jam": 103,
    "Kofta Curry": 112,
    "Lemon Mousse Cake": 12,
    "Mango Delight Recipe": 80,
    "Mango Jam": 42,
    "Mango Kulfi Recipe": 13,
    "Mix Sabzi": 15,
    "Mutton Leg Roast (Raan)": 66,
    "Mutton Paya": 77,
    "Mutton Soup Recipe (Bohra Khurdi)": 61,
    "Nihari Masala": 100,
    "Nihari Recipe": 90,
    "Oreo Balls with Condensed Milk": 32,
    "Oreo Cookie Ice Cream": 19,
    "Pakistani Aloo Palak Recipe": 51,
    "Pakistani Chicken Biryani": 73,
    "Paneer Reshmi Chicken Handi": 8,
    "Papaya Jam": 72,
    "Peach Ice Cream Recipe (No-Eggs)": 25,
    "Peach Jam Recipe without Pectin": 115,
    "Peach Juice": 24,
    "Pear Jam": 113,
    "Plum Ice Cream": 46,
    "Plum Jam Recipe Without Pectin": 50,
    "Plum Juice Recipe": 58,
    "Potato Cheese Balls Recipe": 18,
    "Rocky Road Ice Cream Recipe": 35,
    "Salted Caramel Sauce Recipe": 28,
    "Sarson Ka Saag Pakistani": 82,
    "Shami Kabab Recipe": 26,
    "Sheer Khurma": 5,
    "Soft Roti Recipe (with Secret Tips)": 49,
    "Spicy Chicken Lettuce Wraps": 6,
    "Spicy Chicken Sandwich": 21,
    "Spicy Mongolian Beef": 47,
    "Strawberry Jam without Pectin": 110,
    "Thai Chicken Satay": 79,
    "Thai Red Curry Chicken\u00a0": 95,
    "Tikka Paratha Roll Bake": 74,
    "Tomato Jam Recipe": 89,
    "Vegetable Biryani": 117,
    "Vegetable Samosa": 107,
    "Walnut Brownie Recipe": 52,
    "White Chicken Karahi": 68,
    "White Chicken Korma": 9,
    "Yakhni Pulao": 75
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.48.0"
}
